tap "d12frosted/emacs-plus"
tap "databricks/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "railwaycat/emacsmacport"
brew "adr-tools"
brew "openssl@3"
brew "adr-viewer"
brew "asciidoctor"
brew "coreutils"
brew "asdf"
brew "python@3.11"
brew "azure-cli"
brew "biome"
brew "glib"
brew "qemu"
brew "lima"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fd"
brew "gh"
brew "git"
brew "gitui"
brew "gnupg"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "httpie"
brew "hugo"
brew "node"
brew "ollama"
brew "powerlevel10k"
brew "pre-commit"
brew "ripgrep"
brew "yarn"
brew "zlib"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp", "with-spacemacs-icon"]
brew "databricks/tap/databricks"
brew "jesseduffield/lazygit/lazygit"
brew "railwaycat/emacsmacport/emacs-mac"
cask "meld"
cask "temurin"
cask "zed@preview"
vscode "asciidoctor.asciidoctor-vscode"
vscode "atlassian.atlascode"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "databricks.databricks"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "jebbs.plantuml"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "njpwerner.autodocstring"
vscode "pomdtr.excalidraw-editor"
vscode "randomfractalsinc.vscode-data-table"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "yzhang.markdown-all-in-one"
